In [1]:
import pandas as pd

df = pd.read_csv("C:/Users/lenovo/Downloads//employees.csv")
df

      Name  Age      City  Salary
0    Alice   25  New York   70000
1      Bob   30   Chicago   80000
2  Charlie   28    Boston   75000

In [17]:
df.head(2)

    Name  Age      City  Salary
0  Alice   25  New York   70000
1    Bob   30   Chicago   80000

In [9]:
df.tail(1)

      Name  Age    City  Salary
2  Charlie   28  Boston   75000

In [19]:
df.columns

Index(['Name', 'Age', 'City', 'Salary'], dtype='object')

In [21]:
df.shape

(3, 4)

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
 3   Salary  3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

In [25]:
df.describe()

             Age   Salary
count   3.000000      3.0
mean   27.666667  75000.0
std     2.516611   5000.0
min    25.000000  70000.0
25%    26.500000  72500.0
50%    28.000000  75000.0
75%    29.000000  77500.0
max    30.000000  80000.0

In [35]:
salary = df["Salary"]
print (salary)

0    70000
1    80000
2    75000
Name: Salary, dtype: int64

In [39]:
NameAndCity = df[["Name","City"]]
print (NameAndCity )

      Name      City
0    Alice  New York
1      Bob   Chicago
2  Charlie    Boston

In [51]:
salaryCd = df[df["Salary"]>75000]
print (salaryCd )

  Name  Age     City  Salary
1  Bob   30  Chicago   80000